Additionally, terraform plan shows following:

```
  # module.snowflake.snowflake_warehouse.query-small will be created
  + resource "snowflake_warehouse" "XXX" {
      + auto_resume                         = true
      + auto_suspend                        = 60
      + comment                             = "XXX"
      + enable_query_acceleration           = false
      + id                                  = (known after apply)
      + initially_suspended                 = true
      + max_cluster_count                   = (known after apply)
      + max_concurrency_level               = 8
      + min_cluster_count                   = (known after apply)
      + name                                = "XXX"
      + query_acceleration_max_scale_factor = 8
      + resource_monitor                    = (known after apply)
      + scaling_policy                      = (known after apply)
      + statement_queued_timeout_in_seconds = 0
      + statement_timeout_in_seconds        = 3600
      + warehouse_size                      = "small"
    }
```